Revit 2027 API
BuiltInFailures.StairRampFailures.StairsCommonRunGenerateLayoutFailure Property
 Fail to get base line thus fail to generate run layout
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsCommonRunGenerateLayoutFailure { get; }
Public Shared ReadOnly Property StairsCommonRunGenerateLayoutFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsCommonRunGenerateLayoutFailure {
	FailureDefinitionId^ get ();
}
static member StairsCommonRunGenerateLayoutFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace